Daichou/i2cdevlib/dsPIC30F/MPU6050/MPU6050.c
// XG_OFFS_TC register

uint8_t MPU6050_getOTPBankValid() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_XG_OFFS_TC, MPU6050_TC_OTP_BNK_VLD_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setOTPBankValid(bool enabled) {
    I2Cdev_writeBit(mpu6050.devAddr, MPU6050_RA_XG_OFFS_TC, MPU6050_TC_OTP_BNK_VLD_BIT, enabled);
}
int8_t MPU6050_getXGyroOffsetTC() {
    I2Cdev_readBits(mpu6050.devAddr, MPU6050_RA_XG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setXGyroOffsetTC(int8_t offset) {
    I2Cdev_writeBits(mpu6050.devAddr, MPU6050_RA_XG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, offset);
}

// YG_OFFS_TC register

int8_t MPU6050_getYGyroOffsetTC() {
    I2Cdev_readBits(mpu6050.devAddr, MPU6050_RA_YG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setYGyroOffsetTC(int8_t offset) {
    I2Cdev_writeBits(mpu6050.devAddr, MPU6050_RA_YG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, offset);
}

// ZG_OFFS_TC register

int8_t MPU6050_getZGyroOffsetTC() {
    I2Cdev_readBits(mpu6050.devAddr, MPU6050_RA_ZG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setZGyroOffsetTC(int8_t offset) {
    I2Cdev_writeBits(mpu6050.devAddr, MPU6050_RA_ZG_OFFS_TC, MPU6050_TC_OFFSET_BIT, MPU6050_TC_OFFSET_LENGTH, offset);
}

// X_FINE_GAIN register

int8_t MPU6050_getXFineGain() {
    I2Cdev_readByte(mpu6050.devAddr, MPU6050_RA_X_FINE_GAIN, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setXFineGain(int8_t gain) {
    I2Cdev_writeByte(mpu6050.devAddr, MPU6050_RA_X_FINE_GAIN, gain);
}

// Y_FINE_GAIN register

int8_t MPU6050_getYFineGain() {
    I2Cdev_readByte(mpu6050.devAddr, MPU6050_RA_Y_FINE_GAIN, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setYFineGain(int8_t gain) {
    I2Cdev_writeByte(mpu6050.devAddr, MPU6050_RA_Y_FINE_GAIN, gain);
}

// Z_FINE_GAIN register

int8_t MPU6050_getZFineGain() {
    I2Cdev_readByte(mpu6050.devAddr, MPU6050_RA_Z_FINE_GAIN, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setZFineGain(int8_t gain) {
    I2Cdev_writeByte(mpu6050.devAddr, MPU6050_RA_Z_FINE_GAIN, gain);
}

// XA_OFFS_* registers

int16_t MPU6050_getXAccelOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_XA_OFFS_H, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setXAccelOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_XA_OFFS_H, offset);
}

// YA_OFFS_* register

int16_t MPU6050_getYAccelOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_YA_OFFS_H, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setYAccelOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_YA_OFFS_H, offset);
}

// ZA_OFFS_* register

int16_t MPU6050_getZAccelOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_ZA_OFFS_H, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setZAccelOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_ZA_OFFS_H, offset);
}

// XG_OFFS_USR* registers

int16_t MPU6050_getXGyroOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_XG_OFFS_USRH, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setXGyroOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_XG_OFFS_USRH, offset);
}

// YG_OFFS_USR* register

int16_t MPU6050_getYGyroOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_YG_OFFS_USRH, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setYGyroOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_YG_OFFS_USRH, offset);
}

// ZG_OFFS_USR* register

int16_t MPU6050_getZGyroOffset() {
    I2Cdev_readBytes(mpu6050.devAddr, MPU6050_RA_ZG_OFFS_USRH, 2, mpu6050.buffer);
    return (((int16_t)mpu6050.buffer[0]) << 8) | mpu6050.buffer[1];
}
void MPU6050_setZGyroOffset(int16_t offset) {
    I2Cdev_writeWord(mpu6050.devAddr, MPU6050_RA_ZG_OFFS_USRH, offset);
}

// INT_ENABLE register (DMP functions)

bool MPU6050_getIntPLLReadyEnabled() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_INT_ENABLE, MPU6050_INTERRUPT_PLL_RDY_INT_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setIntPLLReadyEnabled(bool enabled) {
    I2Cdev_writeBit(mpu6050.devAddr, MPU6050_RA_INT_ENABLE, MPU6050_INTERRUPT_PLL_RDY_INT_BIT, enabled);
}
bool MPU6050_getIntDMPEnabled() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_INT_ENABLE, MPU6050_INTERRUPT_DMP_INT_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
void MPU6050_setIntDMPEnabled(bool enabled) {
    I2Cdev_writeBit(mpu6050.devAddr, MPU6050_RA_INT_ENABLE, MPU6050_INTERRUPT_DMP_INT_BIT, enabled);
}

// DMP_INT_STATUS

bool MPU6050_getDMPInt5Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_5_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
bool MPU6050_getDMPInt4Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_4_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
bool MPU6050_getDMPInt3Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_3_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
bool MPU6050_getDMPInt2Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_2_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
bool MPU6050_getDMPInt1Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_1_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}
bool MPU6050_getDMPInt0Status() {
    I2Cdev_readBit(mpu6050.devAddr, MPU6050_RA_DMP_INT_STATUS, MPU6050_DMPINT_0_BIT, mpu6050.buffer);
    return mpu6050.buffer[0];
}

