Daichou/i2cdevlib/dsPIC30F/MPU6050/MPU6050.c
    // It is important to make sure the host processor can keep up with reading and processing
    // the FIFO output at the desired rate. Handling FIFO overflow cleanly is also a good idea.
};

// Constants will be placed in PSV space in xc16
const unsigned char dmpUpdates[MPU6050_DMP_UPDATES_SIZE] = {
    0x01,   0xB2,   0x02,   0xFF, 0xFF,
    0x01,   0x90,   0x04,   0x09, 0x23, 0xA1, 0x35,
    0x01,   0x6A,   0x02,   0x06, 0x00,
    0x01,   0x60,   0x08,   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00,   0x60,   0x04,   0x40, 0x00, 0x00, 0x00,
    0x01,   0x62,   0x02,   0x00, 0x00,
    0x00,   0x60,   0x04,   0x00, 0x40, 0x00, 0x00
};

uint8_t MPU6050_dmpInitialize() {
    // reset device
    //DEBUG_PRINTLN(F("\n\nResetting MPU6050..."));
    MPU6050_reset();
    __delay_ms(30); // wait after reset

    // enable sleep mode and wake cycle
    /*Serial.println(F("Enabling sleep mode..."));
    setSleepEnabled(true);
    Serial.println(F("Enabling wake cycle..."));
    setWakeCycleEnabled(true);*/

    // disable sleep mode
    //DEBUG_PRINTLN(F("Disabling sleep mode..."));
    printf("Disabling sleep mode ....\n");
    MPU6050_setSleepEnabled(false);

    // get MPU hardware revision
    //DEBUG_PRINTLN(F("Selecting user bank 16..."));
    printf("Selecting user bank 16...\n");
    MPU6050_setMemoryBank(0x10, true, true);
    printf("Selecting memory byte 6...");
    MPU6050_setMemoryStartAddress(0x06);
    printf("Checking hardware revision...\n");
    //DEBUG_PRINT(F("Revision @ user[16][6] = "));
    //DEBUG_PRINTLNF(readMemoryByte(), HEX);
    printf("Resetting memory bank selection to 0...\n");
    MPU6050_setMemoryBank(0, false, false);

    // check OTP bank valid
    //DEBUG_PRINTLN(F("Reading OTP bank valid flag..."));
    //DEBUG_PRINT(F("OTP bank is "));
    //DEBUG_PRINTLN(getOTPBankValid() ? F("valid!") : F("invalid!"));

    // get X/Y/Z gyro offsets
    printf("Reading gyro offset TC values...\n");
    int8_t xgOffsetTC = MPU6050_getXGyroOffsetTC();
    int8_t ygOffsetTC = MPU6050_getYGyroOffsetTC();
    int8_t zgOffsetTC = MPU6050_getZGyroOffsetTC();
    printf("X gyro offset = %u\n",xgOffsetTC);
    printf("Y gyro offset = %u\n",ygOffsetTC);
    printf("Z gyro offset = %u\n",zgOffsetTC);
    //DEBUG_PRINTLN(xgOffsetTC);
    //DEBUG_PRINT(F("Y gyro offset = "));
    //DEBUG_PRINTLN(ygOffsetTC);
    //DEBUG_PRINT(F("Z gyro offset = "));
    //DEBUG_PRINTLN(zgOffsetTC);

    // setup weird slave stuff (?)
    printf("Setting slave 0 address to 0x7F...\n");
    MPU6050_setSlaveAddress(0, 0x7F);
    printf("Disabling I2C Master mode...\n");
    MPU6050_setI2CMasterModeEnabled(false);
    printf("Setting slave 0 address to 0x68 (self)...\n");
    MPU6050_setSlaveAddress(0, 0x68);
    printf("Resetting I2C Master control...\n");
    MPU6050_resetI2CMaster();
    __delay_ms(20);

    // load DMP code into memory banks
    printf("Writing DMP code to MPU memory banks \n");
    //DEBUG_PRINT(MPU6050_DMP_CODE_SIZE);
    //DEBUG_PRINTLN(F(" bytes)"));
    if (MPU6050_writeProgMemoryBlock(dmpMemory, MPU6050_DMP_CODE_SIZE,0,0,true)) {
        //DEBUG_PRINTLN(F("Success! DMP code written and verified."));

        // write DMP configuration
        printf("Writing DMP configuration to MPU memory banks \n");
        //DEBUG_PRINT(MPU6050_DMP_CONFIG_SIZE);
        //DEBUG_PRINTLN(F(" bytes in config def)"));
        if (MPU6050_writeProgDMPConfigurationSet(dmpConfig, MPU6050_DMP_CONFIG_SIZE)) {
            //DEBUG_PRINTLN(F("Success! DMP configuration written and verified."));

            printf("Setting clock source to Z Gyro...\n");
            MPU6050_setClockSource(MPU6050_CLOCK_PLL_ZGYRO);

            printf("Setting DMP and FIFO_OFLOW interrupts enabled...\n");
            MPU6050_setIntEnabled(0x12);

            printf("Setting sample rate to 200Hz...\n");
            MPU6050_setRate(4); // 1khz / (1 + 4) = 200 Hz

            //DEBUG_PRINTLN(F("Setting external frame sync to TEMP_OUT_L[0]..."));
            MPU6050_setExternalFrameSync(MPU6050_EXT_SYNC_TEMP_OUT_L);

            //DEBUG_PRINTLN(F("Setting DLPF bandwidth to 42Hz..."));
            MPU6050_setDLPFMode(MPU6050_DLPF_BW_42);

            //DEBUG_PRINTLN(F("Setting gyro sensitivity to +/- 2000 deg/sec..."));
            MPU6050_setFullScaleGyroRange(MPU6050_GYRO_FS_2000);

            printf("Setting DMP programm start address\n");
            //write start address MSB into register
            MPU6050_setDMPConfig1(0x03);
            //write start address LSB into register
            MPU6050_setDMPConfig2(0x00);

            printf("Clearing OTP Bank flag...\n");
            MPU6050_setOTPBankValid(false);

            printf("Setting X/Y/Z gyro offset TCs to previous values...\n");
            MPU6050_setXGyroOffsetTC(xgOffsetTC);
            MPU6050_setYGyroOffsetTC(ygOffsetTC);
            MPU6050_setZGyroOffsetTC(zgOffsetTC);

            //DEBUG_PRINTLN(F("Setting X/Y/Z gyro user offsets to zero..."));
            //setXGyroOffset(0);
            //setYGyroOffset(0);
            //setZGyroOffset(0);

            printf("Writing final memory update 1/7 (function unknown)...\n");
            uint8_t dmpUpdate[16]={0}, j;
            uint16_t pos = 0;
            for (j = 0; j < 4 || j < dmpUpdate[2] + 3; j++, pos++) dmpUpdate[j] = dmpUpdates[pos];
            MPU6050_writeMemoryBlock(dmpUpdate + 3, dmpUpdate[2], dmpUpdate[0], dmpUpdate[1],true,true);

            printf("Writing final memory update 2/7 (function unknown)...\n");
            for (j = 0; j < 4 || j < dmpUpdate[2] + 3; j++, pos++) dmpUpdate[j] = dmpUpdates[pos];
            MPU6050_writeMemoryBlock(dmpUpdate + 3, dmpUpdate[2], dmpUpdate[0], dmpUpdate[1],true,true);

            printf("Resetting FIFO...\n");
            MPU6050_resetFIFO();

            printf("Reading FIFO count...\n");
            uint16_t fifoCount = MPU6050_getFIFOCount();
            uint8_t fifoBuffer[128];

            printf("Current FIFO count = %u\n",fifoCount);
            //DEBUG_PRINT(F("Current FIFO count="));
            //DEBUG_PRINTLN(fifoCount);
            MPU6050_getFIFOBytes(fifoBuffer, fifoCount);

            printf("Setting motion detection threshold to 2...\n");
            MPU6050_setMotionDetectionThreshold(2);

            printf("Setting zero-motion detection threshold to 156...\n");
            MPU6050_setZeroMotionDetectionThreshold(156);

